"""
На вхід дається будь-яке число.
Дізнатися скільки розрядів у числі (1, 2, 3 або більше); позитивне чи негативне?
(напр., 25 - це двозначне позитивне число. -345 - це трьохзначне негативне число.
2400 це 3х і більш значне позитивне число.)
0 врахувати, як окремий варіант.
"""

# number = float(input("Введіть будь-яке число: "))
number = int(input("Введіть будь-яке ціле число: "))

sign = "позитивне число" if number > 0 else "негативне число"

if number == 0:
    print("Це 0.")
elif len(str(abs(number))) == 1:
    # функція len() повертає довжину рядка.
    # ------------------------------------
    # крок1 функція abs(number) бере модуль, таким чином ми відкидаємо знак;
    # крок2 функцією str(abs(number)) далі ми перетворюємо на рядок;
    # крок3 len(str(abs(number))) міряємо довжину рядка;
    # крок4 == 1: якщо 1, то у числі 1 розряд.
    # ------------------------------------
    # напр.:
    # >>> number = -123
    # >>> number
    # >>> -123
    # >>> a = abs(number)   -функція abs() відкидає знак
    # >>> a
    # >>> 123
    # >>> a = str(a)
    # >>> a
    # >>> '123'
    # >>> len(a)
    # >>> 3

    print(f"один розряд або однозначне i {sign}")  # за допомогою f-рядків
elif len(str(abs(number))) == 2:
    print(f"два розряди або двозначне i {sign}")
elif len(str(abs(number))) == 3:
    print(f"три розряди або тризначне i {sign}")
else:
    print(f"багатозначне i {sign}")
#   pass
# Д/з. Спробувати змінити прогу з можливісттю обробляти чизла з комою.
